print(f'Задача - "Функциональное разнообразие"')
"""Lambda-функция:
Из строк: first = 'Мама мыла раму' и second = 'Рамена мало было'
необходимо составить lambda-функцию для следующего выражения - list(map(?, first, second)).
Здесь ? - место написания lambda-функции.
Результатом должен быть список совпадения букв в той же позиции:
[False, True, True, False, False, False, False, False, True, False, False, False, False, False]
Где True - совпало, False - не совпало."""

first = 'Мама мыла раму'
second = 'Рамена мало было'
print(list(map(lambda a, b: a == b, first, second)))


"""Замыкание:
Написать функцию get_advanced_writer(file_name), принимающую название файла для записи.
Внутри этой функции, написать функцию - write_everything(*data_set), где *data_set - 
параметр принимающий  неограниченное количество данных любого типа.
Логика write_everything заключается в добавлении в файл file_name всех данных из data_set в том же виде.
Функция get_advanced_writer возвращает функцию write_everything.
Данный код:
write = get_advanced_writer('example.txt')
write('Это строчка', ['А', 'это', 'уже', 'число', 5, 'в', 'списке'])"""

def get_advanced_writer(file_name):
    def write_everything(*data_set):
        with open(file_name, 'a', encoding='utf8') as file:
            for date in data_set:
                file.write(str(date) + '\n')
    return write_everything

write = get_advanced_writer('Проба.txt')
write('Это строчка', ['А', 'это', 'уже', 'число', 5, 'в', 'списке'])

from random import choice

"""Метод __call__:
Создайте класс MysticBall, объекты которого обладают атрибутом words хранящий коллекцию строк.
В этом классе также определите метод __call__ который будет случайным образом выбирать слово из words и возвращать его. 
Для случайного выбора с одинаковой вероятностью для каждого данного в коллекции можете использовать функцию choice 
из модуля random.
Ваш код (количество слов для случайного выбора может быть другое):
from random import choice
# Ваш класс здесь
first_ball = MysticBall('Да', 'Нет', 'Наверное')
print(first_ball())
print(first_ball())
print(first_ball())
Примерный результат (может отличаться из-за случайности выбора):
Да
Да
Наверное"""

class MysticBall:
    def __init__(self, *words):
        self.words = words
    def __call__(self):
        return choice(self.words)


first_ball = MysticBall('Да', 'Нет', 'Наверное', 'Как получится')
print(first_ball())
print(first_ball())
print(first_ball())